src/InformationRegisters/Радар_Проверки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Радар_Проверки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Хэш</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСтрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозниклоИсключение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОшибок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеОбнаружен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТекстИсключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Радар_Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модуль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Радар_Модули</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Радар_Ошибки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Радар_Ошибки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПозицияНачала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСтрокиНачала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКолонкиНачала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПозицияКонца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСтрокиКонца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКолонкиКонца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьЗамена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинутНаИсправление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Серьезность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Радар_Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модуль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Радар_Модули</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/Радар_Сервер/Ext/Module.bsl
Процедура СообщитьПолеНеЗаполнено(Объект, ИмяПоля, Отказ = Неопределено, Знач СинонимПоля = Неопределено) Экспорт
	
	Если СинонимПоля = Неопределено Тогда
		СинонимПоля = Объект.Метаданные().Реквизиты[ИмяПоля].Синоним;
	КонецЕсли; 
	
	Шаблон = НСтр("ru = 'Поле ""%1"" не заполнено'");
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.УстановитьДанные(Объект);
	Сообщение.Поле = ИмяПоля;
	Сообщение.Текст = СтрШаблон(Шаблон, СинонимПоля);
	Сообщение.Сообщить();
	
	Отказ = Истина;
	
КонецПроцедуры 

Функция ВыгрузитьОшибкиВСонар(Проект) Экспорт
	
	// https://docs.sonarqube.org/latest/analysis/generic-issue/
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Радар_ПроверкиСрезПоследних.Проект КАК Проект,
	|	Радар_ПроверкиСрезПоследних.Модуль КАК Модуль,
	|	Радар_ПроверкиСрезПоследних.Путь КАК Путь,
	|	Радар_Ошибки.Текст КАК Текст,
	|	Радар_Ошибки.ПозицияНачала КАК ПозицияНачала,
	|	Радар_Ошибки.НомерСтрокиНачала КАК НомерСтрокиНачала,
	|	Радар_Ошибки.НомерКолонкиНачала КАК НомерКолонкиНачала,
	|	Радар_Ошибки.ПозицияКонца КАК ПозицияКонца,
	|	Радар_Ошибки.НомерСтрокиКонца КАК НомерСтрокиКонца,
	|	Радар_Ошибки.НомерКолонкиКонца КАК НомерКолонкиКонца,
	|	Радар_Ошибки.ЕстьЗамена КАК ЕстьЗамена,
	|	Радар_Ошибки.Источник КАК Источник,
	|	Радар_Ошибки.Код КАК Код,
	|	Радар_Ошибки.МинутНаИсправление КАК МинутНаИсправление,
	|	Радар_Ошибки.Серьезность КАК Серьезность,
	|	Радар_Ошибки.Приоритет КАК Приоритет,
	|	Радар_Ошибки.Правило КАК Правило,
	|	Радар_Ошибки.Тип КАК Тип
	|ИЗ
	|	РегистрСведений.Радар_Проверки.СрезПоследних(, Проект = &Проект) КАК Радар_ПроверкиСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Радар_Ошибки КАК Радар_Ошибки
	|		ПО Радар_ПроверкиСрезПоследних.Регистратор = Радар_Ошибки.Регистратор
	|			И Радар_ПроверкиСрезПоследних.Проект = Радар_Ошибки.Проект
	|			И Радар_ПроверкиСрезПоследних.Модуль = Радар_Ошибки.Модуль
	|ГДЕ
	|	НЕ Радар_ПроверкиСрезПоследних.НеОбнаружен";
	
	ВыборкаОшибок = Запрос.Выполнить().Выбрать();
	
	Проблемы = Новый Массив;
	
	Пока ВыборкаОшибок.Следующий() Цикл

		Диапазон = Новый Структура;
		Диапазон.Вставить("startLine", ВыборкаОшибок.НомерСтрокиНачала);
		Диапазон.Вставить("endLine", ВыборкаОшибок.НомерСтрокиКонца);
		Диапазон.Вставить("startColumn", ВыборкаОшибок.НомерКолонкиНачала - 1);
		Диапазон.Вставить("endColumn", ВыборкаОшибок.НомерКолонкиКонца - 1);

		Место = Новый Структура;
		Место.Вставить("message", ВыборкаОшибок.Текст);
		Место.Вставить("filePath", ВыборкаОшибок.Путь);
		Место.Вставить("textRange", Диапазон);

		Проблема = Новый Структура;
		Проблема.Вставить("engineId", "radar");
		Проблема.Вставить("ruleId", ВыборкаОшибок.Правило);
		Проблема.Вставить("severity", ВыборкаОшибок.Серьезность);
		Проблема.Вставить("type", ВыборкаОшибок.Тип);
		Проблема.Вставить("primaryLocation", Место);
		Проблема.Вставить("effortMinutes", ВыборкаОшибок.МинутНаИсправление);
		Проблемы.Добавить(Проблема);

	КонецЦикла;

	Отчет = Новый Структура("issues", Проблемы);

	ЗаписьJSON = Новый ЗаписьJSON;
	
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Unix));
	ЗаписатьJSON(ЗаписьJSON, Отчет);
	ТекстОтчета = ЗаписьJSON.Закрыть();
	
	Адрес = ПоместитьВоВременноеХранилище(ТекстОтчета); 
	
	Возврат Адрес;
	
КонецФункции
